Autodesk.Revit.UI.Events.RibbonItemEventArgs.Application
The current UIApplication.

Autodesk.Revit.UI.Events.RibbonItemEventArgs
The base class of the RibbonItem event arguments which have UIApplication property.